Repository: wbrakowski/Admin-Toolbox-OnPrem
Catalog: Translations/Admin-Toolbox.*.xlf
Languages: de_de, es_es

# Table 3103611735 - Property 2879900210
source: Admin Toolbox Setup
de_de: Admin Toolbox Einrichtung
es_es: Configuración de la caja de herramientas de administración

# Table 3103611735 - Field 1415170785 - Property 2879900210
source: Developer License Warning
de_de: Entwicklerlizenz Warnung
es_es: Advertencia sobre la licencia para desarrolladores

# Table 3103611735 - Field 1663593181 - Property 2879900210
source: Primary Key
de_de: Primärschlüssel
es_es: Clave principal

# Table 3025933651 - Field 3133801257 - Property 2879900210
source: Company
de_de: Mandant
es_es: Empresa

# Table 3025933651 - Field 2558632233 - Property 2879900210
source: Delete Records
de_de: Datensätze löschen
es_es: Borrar registros

# Table 3025933651 - Field 2065755396 - Property 2879900210
source: No. of Records
de_de: Anz. Datensätze
es_es: Número de registros

# Table 3025933651 - Field 859139943 - Property 2879900210
source: No. of Table Relation Errors
de_de: Anzahl Fehler Tabellenrelationen
es_es: Número de errores de relación de tablas

# Table 3025933651 - Field 3135334477 - Property 2879900210
source: Table ID
de_de: Tabellen-ID
es_es: ID de la tabla

# Table 3025933651 - Field 3808951907 - Property 2879900210
source: Table Name
de_de: Tabellenname
es_es: Nombre de Tabla

# Table 3576430184 - Field 883711285 - Property 2879900210
source: Entry No.
de_de: Zeilennr.
es_es: Nº Movimiento

# Table 3576430184 - Field 3070320983 - Property 2879900210
source: Field Name
de_de: Feldname
es_es: Nombre del campo

# Table 3576430184 - Field 3531868071 - Property 2879900210
source: Field No.
de_de: Feldnr.
es_es: No. de campo.

# Table 3576430184 - Field 3135334477 - Property 2879900210
source: Table ID
de_de: Tabellen-ID
es_es: ID de la tabla

# Table 2048709543 - Property 2879900210
source: Temp Object in License
de_de: Temp-Objekt in Lizenz
es_es: Objeto temporal en la licencia

# Table 2048709543 - Field 3711240756 - Property 2879900210
source: Object ID
de_de: Objekt-ID
es_es: Objeto ID

# Table 2048709543 - Field 1418569422 - Property 2879900210
source: Object Name
de_de: Objektname
es_es: Nombre del objeto

# Table 2048709543 - Field 1085746399 - Property 2879900210
source: Object Type
de_de: Objektart
es_es: Tipo de objeto

# Table 2048709543 - Field 1085746399 - Property 62802879
source: ,Table,,Report,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
de_de: ,Tabelle,,Bericht,,Codeunit,XMLport,MenuSuite,Seite,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
es_es: ,Tabla,,Informe,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension

# Table 2048709543 - Field 3220827225 - Property 2879900210
source: Used
de_de: Benutzt
es_es: Usado

# Table 4286425647 - Property 2879900210
source: Temp Unlicensed Object
de_de: Temp Unlizenziertes Objekt
es_es: Objeto temporal sin licencia

# Table 4286425647 - Field 3711240756 - Property 2879900210
source: Object ID
de_de: Objekt-ID
es_es: Objeto ID

# Table 4286425647 - Field 1418569422 - Property 2879900210
source: Object Name
de_de: Objektname
es_es: Nombre del objeto

# Table 4286425647 - Field 1085746399 - Property 2879900210
source: Object Type
de_de: Objektart
es_es: Tipo de objeto

# Table 4286425647 - Field 1085746399 - Property 62802879
source: ,Table,,Report,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
de_de: ,Tabelle,,Bericht,,Codeunit,XMLport,MenuSuite,Seite,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
es_es: ,Tabla,,Informe,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension

# Codeunit 4017461657 - Method 2095919535 - NamedType 877858973
source: Checking Relations Between Records!\Table: #1#######
de_de: Überprüfen der Beziehungen zwischen Datensätzen #1 #######
es_es: Comprobación de las relaciones entre los registros: #1#######

# Codeunit 4017461657 - Method 2095919535 - NamedType 2478991407
source: Check Table Relations?
de_de: Tabellenrelationen prüfen?
es_es: ¿Comprobar las relaciones de la tabla?

# Codeunit 4017461657 - Method 2095919535 - NamedType 1761793071
source: %1 => %2 = '%3' does not exist in the '%4' table
de_de: %1 => %2 = '%3' existiert nicht in der Tabelle '%4'.
es_es: %1 => %2 = "%3" no existe en la tabla "%4

# Codeunit 4017461657 - Method 1089747479 - NamedType 1478607934
source: The checkbox %1 was succesfully reset for the tables.
de_de: Das Feld %1 wurde erfolgreich für die Tabellen zurückgesetzt.
es_es: La casilla %1 ha sido restablecida con éxito para las tablas.

# Codeunit 4017461657 - Method 3327007977 - NamedType 3235645552
source: The operation was cancelled by the user.
de_de: Der Vorgang wurde vom Benutzer abgebrochen.
es_es: La operación fue cancelada por el usuario.

# Codeunit 4017461657 - Method 3327007977 - NamedType 669701587
source: %1 table(s) were marked for deletion. All records in these tables will be deleted. Continue?
de_de: %1 Tabellen wurden für die Löschung markiert. Alle Datensätze aus diesen Tabellen werden gelöscht. Fortfahren?
es_es: %1 tabla(s) ha sido marcada(s) para ser eliminada(s). Todos los registros de estas tablas serán eliminados. ¿Continuar?

# Codeunit 4017461657 - Method 3327007977 - NamedType 1617397918
source: Deleting Records!\Table: #1#######
de_de: Lösche Datensätze!\Tabelle: #1#######
es_es: Eliminación de registros: #1#######

# Codeunit 4017461657 - Method 3327007977 - NamedType 2814518218
source: The records from %1 table(s) were succesfully deleted.
de_de: Die Datensätze aus %1 Tabellen wurden erfolgreich gelöscht.
es_es: Los registros de la(s) tabla(s) %1 han sido eliminados con éxito.

# Codeunit 4017461657 - Method 3327007977 - NamedType 3437731031
source: No tables were marked for deletion. Please make sure that you check the Field %1 in the tables where you want to delete records before you run this operation.
de_de: Zum Löschen wurden keine Tabellen markiert. Stellen Sie sicher, dass Sie das Feld %1 in den Tabellen ankreuzen, in denen Sie Datensätze löschen möchten, bevor Sie diesen Vorgang ausführen.
es_es: No se ha marcado ninguna tabla para su eliminación. Por favor, asegúrese de comprobar el campo %1 en las tablas en las que desea eliminar registros antes de ejecutar esta operación.

# Codeunit 4017461657 - Method 3327007977 - NamedType 3203928494
source: Delete records without deletion trigger: Record.Delete(false),Delete records with deletion trigger: Record.Delete(true)
de_de: Löschen von Datensätzen ohne Delete Trigger: Record.Delete(false),Löschen von Datensätzen mit Delete Trigger: Record.Delete(true)
es_es: Borrar registros sin disparador de borrado: Record.Delete(false),Eliminar registros con disparador de eliminación: Record.Delete(true)

# Codeunit 4017461657 - Method 529433861 - NamedType 1875284373
source: No record could be found in table %1.
de_de: In der Tabelle %1 konnte kein Datensatz gefunden werden.
es_es: No se ha podido encontrar ningún registro en la tabla %1.

# Codeunit 4017461657 - Method 529433861 - NamedType 577911013
source: Processing tables... @1@@@@@@
de_de: Verarbeite Tabellen... @1@@@@@@
es_es: Procesando tablas... @1@@@@@@

# Codeunit 4017461657 - Method 529433861 - NamedType 1709914334
source: %1 tables have succesfully been updated.
de_de: %1 Tabellen wurden erfolgreich aktualisiert.
es_es: %1 tablas han sido actualizadas con éxito.

# Codeunit 4017461657 - Method 3420767252 - NamedType 2377828003
source: The external deployer must be installed on the server instance to publish apps. Please select how you want to proceed.
de_de: Der External Deployer muss auf der Serverinstanz installiert sein, um Apps zu veröffentlichen. Wählen Sie aus, wie Sie fortfahren möchten.
es_es: El desplegador externo debe estar instalado en la instancia del servidor para publicar aplicaciones. Por favor, seleccione cómo quiere proceder.

# Codeunit 4017461657 - Method 3420767252 - NamedType 3203928494
source: Continue publishing app (a new tab will be opened),Learn how to install the external deployer
de_de: Weiter mit der Veröffentlichung der App (ein neuer Tab wird geöffnet),Öffnen Sie die Anleitung für die Installation des External Deployer
es_es: Continuar publicando la aplicación (se abrirá una nueva pestaña),Aprender a instalar el desplegador externo

# Codeunit 4017461657 - Method 1304378668 - NamedType 705934383
source: Attention, the developer license is currently active.
de_de: Achtung, die Entwicklerlizenz ist derzeit aktiv.
es_es: Atención, la licencia de desarrollador está actualmente activa.

# Codeunit 4017461657 - Method 542369812 - NamedType 3203928494
source: Suggest all transactional records to delete,Suggest unlicensed partner or custom records to delete
de_de: Alle transaktionalen Datensätze zum Löschen vorschlagen,Alle nicht lizenzierten Partner- oder Customdatensätze vorschlagen.
es_es: Sugerir la eliminación de todos los registros transaccionales,Sugerir la eliminación de registros de socios o personalizados sin licencia

# Codeunit 4017461657 - Method 3094011 - NamedType 1104668713
source: %1 records to delete were suggested.
de_de: %1 Datensätze wurden zum Löschen vorgeschlagen.
es_es: Se han sugerido %1 registros a eliminar.

# Codeunit 4017461657 - Method 1419025072 - NamedType 1018787915
source: It looks like a developer license is currently imported. The use of this function is intended for customer licenses. Do you want to import another license now?
de_de: Es sieht so aus, als ob derzeit eine Entwicklerlizenz importiert ist. Die Verwendung dieser Funktion ist für Kundenlizenzen vorgesehen. Möchten Sie jetzt eine andere Lizenz importieren?
es_es: Parece que actualmente se importa una licencia de desarrollador. El uso de esta función está destinado a las licencias de cliente. ¿Desea importar otra licencia ahora?

# Codeunit 4017461657 - Method 1419025072 - NamedType 3507336724
source: A developer license will be required to delete the marked unlicensed records. Do you want to import another license now?
de_de: Eine Entwicklerlizenz ist erforderlich, um die markierten nicht lizenzierten Datensätze zu löschen. Möchten Sie jetzt eine weitere Lizenz importieren?
es_es: Se necesitará una licencia de desarrollador para eliminar los registros marcados como no autorizados. Desea importar otra licencia ahora?

# Codeunit 4017461657 - Method 1419025072 - NamedType 2880885934
source: %1 unlicensed partner or custom records were suggested.
de_de: %1 unlizenzierte Datensätze aus Custom- oder Partnertabellen wurden vorgeschlagen.
es_es: {Se sugirieron registros de socios o personalizados.

# Codeunit 4224254571 - Method 2839364610 - NamedType 1626985572
source: Busy importing......
de_de: Importiere......
es_es: Ocupado importando......

# Codeunit 4224254571 - Method 2839364610 - NamedType 2564551424
source: License (*.flf)|*.flf|All Files (*.*)|*.*
de_de: Lizenz (*.flf)|*.flf|Alle Dateien(*.*)|*.*
es_es: Licencia (*.flf)|*.flf|Todos los archivos (*.*)|*.*

# Codeunit 4224254571 - Method 2839364610 - NamedType 494866634
source: Select License File
de_de: Wählen Sie die Lizenzdatei
es_es: Seleccione el archivo de licencia

# Page 3768843830 - Property 1064389655
source: About the Admin Toolbox
de_de: Informationen zur Admin Toolbox
es_es: Acerca de la caja de herramientas de administración

# Page 3768843830 - Property 247559172
source: This toolbox assists you with the following tasks: deleting or editing records, viewing or importing licenses, running tables, publishing apps.
de_de: Diese Toolbox unterstützt Sie bei folgenden Aufgaben: Löschen oder Bearbeiten von Datensätzen, Anzeigen oder Importieren von Lizenzen, Ausführen von Tabellen, Veröffentlichen von Apps.
es_es: Esta caja de herramientas le ayuda a realizar las siguientes tareas: eliminar o editar registros, ver o importar licencias, ejecutar tablas, publicar aplicaciones.

# Page 3768843830 - Property 2879900210
source: Admin Toolbox
es_es: Caja de herramientas de administración

# Page 3768843830 - NamedType 717117876
source: Active Session
es_es: Sesión activa

# Page 3768843830 - NamedType 2999183383
source: All Objects
es_es: Todos los objetos

# Page 3768843830 - NamedType 2107531320
source: API Webhook Notification
es_es: Notificación API Webhook

# Page 3768843830 - NamedType 163338518
source: API Webhook Subscription
es_es: Suscripción al API Webhook

# Page 3768843830 - NamedType 1506485208
source: Codeunit Metadata
es_es: Metadatos de la unidad de código

# Page 3768843830 - NamedType 117816908
source: Field
es_es: Campo

# Page 3768843830 - NamedType 868925555
source: Learn how to use this tool
de_de: Lerne dieses Tool zu benutzen
es_es: Aprenda a utilizar esta herramienta

# Page 3768843830 - NamedType 3446133255
source: Key
es_es: Clave

# Page 3768843830 - NamedType 2192953510
source: License Permission
es_es: Permiso de licencia

# Page 3768843830 - NamedType 3860426192
source: Page Metadata
es_es: Metadatos de la página

# Page 3768843830 - NamedType 689028025
source: Record Link
es_es: Enlace al disco

# Page 3768843830 - NamedType 1443383892
source: Session Event
es_es: Evento de la sesión

# Page 3768843830 - NamedType 905130876
source: Session Information
es_es: Información de la sesión

# Page 3768843830 - NamedType 742817619
source: Table Metadata
es_es: Metadatos de la tabla

# Page 3768843830 - Method 716454850 - NamedType 486125896
source: No table to run selected
de_de: Keine Tabelle zum Ausführen ausgewählt
es_es: No se ha seleccionado ninguna tabla para ejecutar

# Page 3768843830 - Method 716454850 - NamedType 375350412
source: Use the three dots on the right to select a table that you want to run
de_de: Nutzen Sie die drei Punkte rechts, um eine Tabelle für die Ausführung auszuwählen
es_es: Utilice los tres puntos de la derecha para seleccionar una tabla que desee ejecutar

# Page 3768843830 - Control 1498101029 - Property 2879900210
source: How To
es_es: Cómo se hace

# Page 3768843830 - Control 868925555 - Property 1064389655
source: How to use this app
de_de: So verwenden Sie diese App
es_es: Cómo utilizar esta aplicación

# Page 3768843830 - Control 868925555 - Property 1295455071
source: Specifies the link that opens the documentation.
de_de: Gibt den Link an, über den die Dokumentation geöffnet wird.
es_es: Especifica el enlace que abre la documentación.

# Page 3768843830 - Control 868925555 - Property 247559172
source: Click on the link to open the documentation for the Admin Toolbox.
de_de: Klicken Sie auf den Link, um die Dokumentation für die Admin Toolbox zu öffnen.
es_es: Haga clic en el enlace para abrir la documentación de la caja de herramientas de administración.

# Page 3768843830 - Control 419426744 - Property 1064389655
source: About information
de_de: Über Informationen
es_es: Acerca de la información

# Page 3768843830 - Control 419426744 - Property 247559172
source: The links in this fast tab will run the different tables.
de_de: Über die Links in dieser schnellen Registerkarte können Sie die verschiedenen Tabellen aufrufen.
es_es: Los enlaces de esta pestaña rápida ejecutarán las diferentes tablas.

# Page 3768843830 - Control 419426744 - Property 2879900210
source: Information
de_de: Informationen
es_es: Información

# Page 3768843830 - Control 2107531320 - Property 1295455071
source: Specifies the link that will run the table "API Webhook Notification".
de_de: Gibt den Link an, über den die Tabelle "API Webhook Notification" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "API Webhook Notification".

# Page 3768843830 - Control 163338518 - Property 1295455071
source: Specifies the link that will run the table "API Webhook Subscription".
de_de: Gibt den Link an, über den die Tabelle "API Webhook Subscription" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "API Webhook Subscription".

# Page 3768843830 - Control 3357837221 - Property 2879900210
source: License
de_de: Lizenz
es_es: Licencia

# Page 3768843830 - Control 2192953510 - Property 1295455071
source: Specifies the link that will run the table "License Permission".
de_de: Gibt den Link an, über den die Tabelle "License Permission" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Permiso de licencia".

# Page 3768843830 - Control 1506485208 - Property 1295455071
source: Specifies the link that will run the table "Codeunit Metadata".
de_de: Gibt den Link an, über den die Tabelle "Codeunit Metadata" aufgerufen wird.
es_es: Especifica el enlace que ejecutará la tabla "Codeunit Metadata".

# Page 3768843830 - Control 3860426192 - Property 1295455071
source: Specifies the link that will run the table "Page Metadata".
de_de: Gibt den Link an, über den die Tabelle "Page Metadata" aufgerufen wird.
es_es: Especifica el enlace que ejecutará la tabla "Page Metadata".

# Page 3768843830 - Control 742817619 - Property 1295455071
source: Specifies the link that will run the table "Table Metadata".
de_de: Gibt den Link an, über die die Tabelle "Table Metadata" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Table Metadata".

# Page 3768843830 - Control 2123958759 - Property 2879900210
source: Object
de_de: Objekt
es_es: Objeto

# Page 3768843830 - Control 2999183383 - Property 1295455071
source: Specifies the link that will run the table "AllObj".
de_de: Gibt den Linkan, über die die Tabelle "AllObj" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "AllObj".

# Page 3768843830 - Control 117816908 - Property 1295455071
source: Specifies the link that will run the table "Field".
de_de: Gibt den Link an, über die die Tabelle "Field" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Campo".

# Page 3768843830 - Control 3446133255 - Property 1295455071
source: Specifies the link that will run the table "Key".
de_de: Gibt den Link an, über die die Tabelle "Key" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Clave".

# Page 3768843830 - Control 689028025 - Property 1295455071
source: Specifies the link that will run the table "Record Link".
de_de: Gibt den Link an, über den die Tabelle "Record Link" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Record Link".

# Page 3768843830 - Control 3117446396 - Property 1064389655
source: About Table Selector
de_de: Über Table Selector
es_es: Acerca del selector de mesas

# Page 3768843830 - Control 3117446396 - Property 247559172
source: Use the table selector if you want to run a specific table.
de_de: Verwenden Sie die Tabellenauswahl, wenn Sie eine bestimmte Tabelle ausführen möchten.
es_es: Utilice el selector de tablas si desea ejecutar una tabla específica.

# Page 3768843830 - Control 3117446396 - Property 2879900210
source: Table Selector
de_de: Tabellenauswahl
es_es: Selector de mesa

# Page 3768843830 - Control 659315829 - Property 1295455071
source: Specifies the table no. that you want to run with the table selector.
de_de: Gibt die Tabellennummer an, die Sie mit dem Tabellenselektor ausführen möchten.
es_es: Especifica el número de tabla que desea ejecutar con el selector de tabla.

# Page 3768843830 - Control 2846103777 - Property 1295455071
source: Specifies the table name that you want to run with the table selector.
de_de: Gibt den Tabellennamen an, den Sie mit dem Tabellenselektor ausführen möchten.
es_es: Especifica el nombre de la tabla que desea ejecutar con el selector de tablas.

# Page 3768843830 - Control 2846103777 - Method 1845446376 - NamedType 1108583558
source: Please select a "Table No." before running this link.
de_de: Bitte wählen Sie eine "Tabellennr." bevor Sie den Link ausführen.
es_es: Por favor, seleccione un "número de mesa" antes de ejecutar este enlace.

# Page 3768843830 - Control 381004922 - Property 2879900210
source: Session
es_es: Sesión

# Page 3768843830 - Control 717117876 - Property 1295455071
source: Specifies the link that will run the table "Active Session".
de_de: Gibt den Link an, über den die Tabelle "Active Session" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Sesión activa".

# Page 3768843830 - Control 1443383892 - Property 1295455071
source: Specifies the link that will run the table "Session Event".
de_de: Gibt den Link an, über den die Tabelle "Session Event" ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Evento de sesión".

# Page 3768843830 - Control 905130876 - Property 1295455071
source: Specifies the link that will run the table "Session".
de_de: Gibt den Link an, über den die Tabelle "SitzungSession ausgeführt wird.
es_es: Especifica el enlace que ejecutará la tabla "Sesión".

# Page 3768843830 - Control 2462631585 - Property 1064389655
source: About license information
de_de: Über Lizenzinformationen
es_es: Sobre la información de la licencia

# Page 3768843830 - Control 2462631585 - Property 247559172
source: View the details of your current license or import a new license.
de_de: Zeigen Sie die Details Ihrer aktuellen Lizenz an oder importieren Sie eine neue Lizenz.
es_es: Vea los detalles de su licencia actual o importe una nueva licencia.

# Page 3768843830 - Control 1061736343 - Property 1064389655
source: About tables
de_de: Über Tabellen
es_es: Sobre las mesas

# Page 3768843830 - Control 1061736343 - Property 247559172
source: This is an overview of all the tables in the system. You can run the table, delete all records from a table, edit specific records, delete a selection of records.
de_de: Dies ist eine Übersicht über alle Tabellen im System. Sie können die Tabelle ausführen, alle Datensätze aus einer Tabelle löschen, bestimmte Datensätze bearbeiten, eine Auswahl von Datensätzen löschen.
es_es: Esta es una visión general de todas las tablas del sistema. Puede ejecutar la tabla, eliminar todos los registros de una tabla, editar registros específicos, eliminar una selección de registros.

# Page 3768843830 - Action 1514883969 - Property 1064389655
source: About the setup
de_de: Über die Einrichtung
es_es: Acerca de la configuración

# Page 3768843830 - Action 1514883969 - Property 1295455071
source: Opens the setup of the Admin Toolbox.
de_de: Öffnet die Einrichtung der Admin Toolbox.
es_es: Abre la configuración de la caja de herramientas de administración.

# Page 3768843830 - Action 1514883969 - Property 247559172
source: Open the setup if you want to set up additional functionalities of the Admin Toolbox.
de_de: Öffnen Sie die Einrichtung, wenn Sie zusätzliche Funktionen der Admin Toolbox einrichten möchten.
es_es: Abra la configuración si desea configurar funcionalidades adicionales de la Caja de Herramientas del Administrador.

# Page 3768843830 - Action 1514883969 - Property 2879900210
source: Setup
de_de: Einrichtung
es_es: Configuración

# Page 3768843830 - Action 2095919535 - Property 1064389655
source: Check your tables for relation errors
de_de: Überprüfen Sie Ihre Tabellen auf Beziehungsfehler
es_es: Compruebe sus tablas para ver si hay errores de relación
