Repository: wbrakowski/Admin-Toolbox-OnPrem
Catalog: Translations/Admin-Toolbox.*.xlf
Languages: de_de, es_es

# Page 3768843830 - Action 2095919535 - Property 1295455071
source: This function runs through all records and uses the field relations defined in the table "Field" in Business Central to validate the table relations.
de_de: Diese Funktion durchläuft alle Datensätze und verwendet die in der Tabelle "Feld" in Business Central definierten Feldbeziehungen, um die Tabellenbeziehungen zu überprüfen.
es_es: Esta función recorre todos los registros y utiliza las relaciones de campo definidas en la tabla "Campo" de Business Central para validar las relaciones de la tabla.

# Page 3768843830 - Action 2095919535 - Property 247559172
source: Runs through all records and uses the field relations defined in the table "Field" in Business Central to validate the table relations.
de_de: Durchläuft alle Datensätze und verwendet die in der Tabelle "Feld" in Business Central definierten Feldbeziehungen, um die Tabellenbeziehungen zu überprüfen.
es_es: Recorre todos los registros y utiliza las relaciones de campo definidas en la tabla "Campo" de Business Central para validar las relaciones de la tabla.

# Page 3768843830 - Action 2095919535 - Property 2879900210
source: Check Table Relations
de_de: Tabellenrelationen prüfen
es_es: Comprobar las relaciones de la tabla

# Page 3768843830 - Action 666624329 - Property 1064389655
source: Your fellow cleaning service
de_de: Ihr Kollege vom Reinigungsdienst
es_es: Su compañero de servicio de limpieza

# Page 3768843830 - Action 666624329 - Property 1295455071
source: Clears the checkboxes of the field "Delete Records" in all tables.
de_de: Entfernt den Haken aus dem Feld "Datensätze löschen" in allen Tabellen.
es_es: Borra las casillas de verificación del campo "Eliminar registros" en todas las tablas.

# Page 3768843830 - Action 666624329 - Property 247559172
source: Clears the checkboxes of the field "Delete Records" in all tables.
de_de: Entfernt den Haken aus dem Feld des Feldes "Datensätze löschen" in allen Tabellen.
es_es: Borra las casillas de verificación del campo "Eliminar registros" en todas las tablas.

# Page 3768843830 - Action 666624329 - Property 2879900210
source: Clear Records to Delete
de_de: Lösch-Markierung bei Datensätzen entfernen
es_es: Borrar registros para eliminar

# Page 3768843830 - Action 3327007977 - Property 1064389655
source: The bad evil executioner
de_de: Der böse Henker
es_es: El malvado verdugo

# Page 3768843830 - Action 3327007977 - Property 1295455071
source: Opens a dialog and if confirmed deletes the records from the tables where the field "Delete Records" is checked off.
de_de: Öffnet einen Dialog und löscht bei Bestätigung die Datensätze aus den Tabellen, in denen das Feld "Datensätze löschen" angekreuzt ist.
es_es: Abre un diálogo y, si se confirma, elimina los registros de las tablas en las que el campo "Eliminar registros" está marcado.

# Page 3768843830 - Action 3327007977 - Property 247559172
source: Use this action to delete the records that were suggested to you or that you marked for deletion yourself.
de_de: Mit dieser Aktion können Sie die Datensätze löschen, die Ihnen vorgeschlagen wurden oder die Sie selbst zum Löschen markiert haben.
es_es: Utilice esta acción para eliminar los registros que le fueron sugeridos o que usted mismo marcó para su eliminación.

# Page 3768843830 - Action 3327007977 - Property 2879900210
source: Delete Marked Records
de_de: Markierte Datensätze löschen
es_es: Borrar registros marcados

# Page 3768843830 - Action 3774338566 - Property 1064389655
source: A very powerful table editor
de_de: Ein mächtiger Tabelleneditor
es_es: Un editor de tablas muy potente

# Page 3768843830 - Action 3774338566 - Property 1295455071
source: Opens the table editor where you can edit or delete selected records.
de_de: Öffnet den Tabelleneditor, in dem Sie ausgewählte Datensätze bearbeiten oder löschen können.
es_es: Abre el editor de la tabla donde puede editar o eliminar los registros seleccionados.

# Page 3768843830 - Action 3774338566 - Property 247559172
source: Use this action to open the table editor where you can edit or delete selected records.
de_de: Verwenden Sie diese Aktion, um den Tabelleneditor zu öffnen, in dem Sie ausgewählte Datensätze bearbeiten oder löschen können.
es_es: Utilice esta acción para abrir el editor de la tabla donde puede editar o eliminar los registros seleccionados.

# Page 3768843830 - Action 3774338566 - Property 2879900210
source: Edit Table
de_de: Tabelle bearbeiten
es_es: Editar Mesa

# Page 3768843830 - Action 529433861 - Property 1064389655
source: Fills or updates the "Table" sub page
de_de: Füllt oder aktualisiert die Sub page"Tabellen"
es_es: Rellena o actualiza la subpágina "Tabla"

# Page 3768843830 - Action 529433861 - Property 1295455071
source: Inserts or updates the table information in the fast tab "Tables" for all the tables in the system.
de_de: Einfügen oder Aktualisieren der Tabelleninformationen auf der Schnellregisterkarte "Tabellen" für alle Tabellen im System.
es_es: Inserta o actualiza la información de la tabla en la pestaña rápida "Tablas" para todas las tablas del sistema.

# Page 3768843830 - Action 529433861 - Property 247559172
source: Use this function if your want to see the tables in the system or want to edit/delete records
de_de: Verwenden Sie diese Funktion, wenn Sie die Tabellen im System sehen oder Datensätze bearbeiten/löschen möchten
es_es: Utilice esta función si quiere ver las tablas del sistema o quiere editar/borrar registros

# Page 3768843830 - Action 529433861 - Property 2879900210
source: Insert/Update Tables
de_de: Tabellen einfügen/aktualisieren
es_es: Insertar/actualizar tablas

# Page 3768843830 - Action 3420767252 - Property 1064389655
source: Publish and Install apps without powershell
de_de: Veröffentlichen und Installieren von Anwendungen ohne Powershell
es_es: Publicar e instalar aplicaciones sin powershell

# Page 3768843830 - Action 3420767252 - Property 1295455071
source: Publishes and installs the selected app by using the powershell runner.
de_de: Veröffentlichen und installieren Sie die ausgewählte Anwendung mithilfe des Powershell-Runners.
es_es: Publica e instala la aplicación seleccionada utilizando el corredor de powershell.

# Page 3768843830 - Action 3420767252 - Property 247559172
source: Instead of using powershell, you can use this action to publish and install apps. The action will use the powershellrunner to publish and install the app.
de_de: Anstelle der Powershell können Sie diese Aktion zum Veröffentlichen und Installieren von Anwendungen verwenden. Die Aktion verwendet den powershellrunner, um die App zu veröffentlichen und zu installieren.
es_es: En lugar de utilizar powershell, puede utilizar esta acción para publicar e instalar aplicaciones. La acción utilizará el powershellrunner para publicar e instalar la app.

# Page 3768843830 - Action 3420767252 - Property 2879900210
source: Publish and Install App
de_de: App veröffentlichen und installieren
es_es: Publicar e instalar la aplicación

# Page 3768843830 - Action 3798165307 - Property 1064389655
source: Your assistant if you want to delete all records from tables
de_de: Ihr Assistent, wenn Sie alle Datensätze aus Tabellen löschen möchten
es_es: Su asistente si desea eliminar todos los registros de las tablas

# Page 3768843830 - Action 3798165307 - Property 1295455071
source: Opens a dialog and ask you which records you want to delete. If you continue, the field "Delete records" of the suggested tables will be checked off in the table overview.
de_de: Öffnet einen Dialog und fragt Sie, welche Datensätze Sie löschen möchten. Wenn Sie fortfahren, wird das Feld "Datensätze löschen" der vorgeschlagenen Tabellen in der Tabellenübersicht abgehakt.
es_es: Abre un diálogo y le pregunta qué registros quiere eliminar. Si continúa, el campo "Eliminar registros" de las tablas sugeridas se marcará en la vista general de la tabla.

# Page 3768843830 - Action 3798165307 - Property 247559172
source: Suggests you records that you may want to delete by checking off the field "Delete Records". This is useful if you want to "clean" a company from transactional data.
de_de: Schlägt Ihnen Datensätze vor, die Sie eventuell löschen möchten, indem das Feld "Datensätze löschen" gesetzt wird. Dies ist nützlich, wenn Sie einen Mandanten von Transaktionsdaten "bereinigen" wollen.
es_es: Le sugiere los registros que puede querer eliminar marcando el campo "Eliminar registros". Esto es útil si quiere "limpiar" una empresa de datos transaccionales.

# Page 3768843830 - Action 3798165307 - Property 2879900210
source: Suggest Records to Delete
de_de: Datensätze zum Löschen vorschlagen
es_es: Sugerir registros para eliminar

# Page 3768843830 - Action 2549815061 - Property 1064389655
source: View the records of the table
de_de: Anzeigen der Datensätze der Tabelle
es_es: Ver los registros de la tabla

# Page 3768843830 - Action 2549815061 - Property 1295455071
source: Runs the selected table in a separate window.
de_de: Führt die ausgewählte Tabelle in einem separaten Fenster aus.
es_es: Ejecuta la tabla seleccionada en una ventana separada.

# Page 3768843830 - Action 2549815061 - Property 247559172
source: This will run the selected table in a separate window.
de_de: Dadurch wird die ausgewählte Tabelle in einem separaten Fenster ausgeführt.
es_es: Esto ejecutará la tabla seleccionada en una ventana separada.

# Page 3768843830 - Action 2549815061 - Property 2879900210
source: View Records
de_de: Datensätze anzeigen
es_es: Ver registros

# Page 3103611735 - Property 1064389655
source: About Admin Toolbox Setup
de_de: Über die Einrichtung der Admin-Toolbox
es_es: Acerca de la configuración de la caja de herramientas del administrador

# Page 3103611735 - Property 247559172
source: Setup additional functionalities of the Admin Toolbox. It only contains additional functionalities for OnPrem environments.
de_de: Einrichtung zusätzlicher Funktionen der Admin Toolbox. Sie enthält nur zusätzliche Funktionalitäten für OnPrem-Umgebungen.
es_es: Configurar las funcionalidades adicionales de la caja de herramientas de administración. Sólo contiene funcionalidades adicionales para entornos OnPrem.

# Page 3103611735 - Property 2879900210
source: Admin Toolbox Setup
de_de: Admin Toolbox Einrichtung
es_es: Configuración de la caja de herramientas de administración

# Page 3103611735 - Method 716454850 - NamedType 2566144142
source: It was detected that this is not an OnPrem environment. The Admin Tool Setup only contains additional functionalities for OnPrem environments.
de_de: Es wurde festgestellt, dass es sich nicht um eine OnPrem-Umgebung handelt. Das Admin Tool Setup enthält nur zusätzliche Funktionalitäten für OnPrem-Umgebungen.
es_es: Se ha detectado que no se trata de un entorno OnPrem. La configuración de la herramienta de administración sólo contiene funcionalidades adicionales para los entornos OnPrem.

# Page 3103611735 - Control 3357837221 - Property 2879900210
source: License
de_de: Lizenz
es_es: Licencia

# Page 3103611735 - Control 1415170785 - Property 1064389655
source: Always be informed if a developer license is imported in systems where it should not be imported.
de_de: Seien Sie immer informiert, wenn eine Entwicklerlizenz in Systeme importiert wird, in die sie nicht importiert werden sollte.
es_es: Infórmese siempre si se importa una licencia de desarrollador en sistemas en los que no debería importarse.

# Page 3103611735 - Control 1415170785 - Property 1295455071
source: Specifies if a warning should be shown on opening the company when a developer license is active (only OnPrem).
de_de: Gibt an, ob beim Öffnen des Unternehmens eine Warnung angezeigt werden soll, wenn eine Entwicklerlizenz aktiv ist (nur OnPrem).
es_es: Especifica si se debe mostrar una advertencia al abrir la empresa cuando una licencia de desarrollador está activa (sólo OnPrem).

# Page 3103611735 - Control 1415170785 - Property 247559172
source: If enabled, a message will be shown OnCompanyOpen that the developer license is active. Enable this field in test environments to make sure that no developer license is wrongfully imported.
de_de: Wenn diese Option aktiviert ist, wird OnCompanyOpen eine Meldung angezeigt, dass die Entwicklerlizenz aktiv ist. Aktivieren Sie dieses Feld in Testumgebungen, um sicherzustellen, dass keine Entwicklerlizenz fälschlicherweise importiert wird.
es_es: Si se habilita, se mostrará un mensaje OnCompanyOpen de que la licencia de desarrollador está activa. Habilite este campo en los entornos de prueba para asegurarse de que no se importa erróneamente ninguna licencia de desarrollador.

# Page 3103611735 - Control 4149399399 - Property 1064389655
source: Shows you information about the active license.
de_de: Zeigt Ihnen Informationen über die aktive Lizenz an.
es_es: Muestra información sobre la licencia activa.

# Page 3103611735 - Control 4149399399 - Property 1295455071
source: Specifies if the active license is a developer license.
de_de: Gibt an, ob die aktive Lizenz eine Entwicklerlizenz ist.
es_es: Especifica si la licencia activa es una licencia de desarrollador.

# Page 3103611735 - Control 4149399399 - Property 247559172
source: If a developer license was imported in the system, this field will be checked off.
de_de: Wenn eine Entwicklerlizenz in das System importiert wurde, ist dieses Feld angekreuzt.
es_es: Si se ha importado una licencia de desarrollador en el sistema, este campo estará marcado.

# Page 3103611735 - Control 4149399399 - Property 2879900210
source: Developer License
de_de: Entwicklerlizenz
es_es: Licencia para desarrolladores

# Page 1618956314 - Control 3711240756 - Property 1295455071
source: Specifies the value of the Object ID field.
de_de: Gibt die Objekt ID an.
es_es: Especifica el valor del campo ID de objeto.

# Page 1618956314 - Control 1418569422 - Property 1295455071
source: Specifies the value of the Object Name field.
de_de: Gibt den Objektnamen an.
es_es: Especifica el valor del campo Nombre del objeto.

# Page 1618956314 - Control 1085746399 - Property 1295455071
source: Specifies the value of the Object Type field.
de_de: Gibt den Wert des Feldes Objekttyp an.
es_es: Especifica el valor del campo Tipo de objeto.

# Page 1725951601 - Property 2879900210
source: License Information
de_de: Lizenzinformationen
es_es: Información de la licencia

# Page 1725951601 - Control 4149399399 - Property 1295455071
source: Specifies if the active license is a developer license.
de_de: Gibt an, ob die aktive Lizenz eine Entwicklerlizenz ist.
es_es: Especifica si la licencia activa es una licencia de desarrollador.

# Page 1725951601 - Control 4149399399 - Property 2879900210
source: Developer License
de_de: Entwicklerlizenz
es_es: Licencia para desarrolladores

# Page 1725951601 - Control 1821279055 - Property 1295455071
source: Specifies the value of the Text field
de_de: Gibt den Wert des Feldes Text an
es_es: Especifica el valor del campo Texto

# Page 1725951601 - Action 1246810302 - Property 1295455071
source: Creates a list with all used and unused objects in the license.
de_de: Erzeugt eine Liste mit allen verwendeten und nicht verwendeten Objekten in der Lizenz.
es_es: Crea una lista con todos los objetos utilizados y no utilizados en la licencia.

# Page 1725951601 - Action 1246810302 - Property 2879900210
source: Export Used and Unused Objects in License
de_de: Verwendete und nicht verwendete Objekte exportieren
es_es: Exportar objetos usados y no usados en la licencia

# Page 1725951601 - Action 1167558626 - Property 1295455071
source: Creates a list with all unlicensed objects.
de_de: Erzeugt eine Liste mit allen nicht lizenzierten Objekten.
es_es: Crea una lista con todos los objetos sin licencia.

# Page 1725951601 - Action 1167558626 - Property 2879900210
source: Export Unlicensed Objects
de_de: Nicht lizenzierte Objekte exportieren
es_es: Exportar objetos sin licencia

# Page 1725951601 - Action 2839364610 - Property 1295455071
source: Imports the selected license.
de_de: Importiert die ausgewählte Lizenz.
es_es: Importa la licencia seleccionada.

# Page 1725951601 - Action 2839364610 - Property 2879900210
source: Import License
de_de: Lizenz importieren
es_es: Licencia de importación

# Page 935494845 - Property 2879900210
source: License Permissions
de_de: Lizenzberechtigungen
es_es: Permisos de licencia

# Page 935494845 - Control 3735914638 - Property 1295455071
source: Specifies the value of the Delete Permission field.
de_de: Gibt den Wert des Feldes Löschberechtigung an.
es_es: Especifica el valor del campo Permiso de eliminación.

# Page 935494845 - Control 480834248 - Property 1295455071
source: Specifies the value of the Execute Permission field.
de_de: Gibt den Wert des Feldes Ausführungserlaubnis an.
es_es: Especifica el valor del campo Permiso de Ejecución.

# Page 935494845 - Control 3088155792 - Property 1295455071
source: Specifies the value of the Insert Permission field.
de_de: Gibt den Wert des Feldes Einfügeerlaubnis an.
es_es: Especifica el valor del campo Permiso de inserción.

# Page 935494845 - Control 3767204390 - Property 1295455071
source: Specifies the value of the Limited Usage Permission field.
de_de: Gibt den Wert des Feldes Beschränkte Nutzungserlaubnis an.
es_es: Especifica el valor del campo Permiso de uso limitado.

# Page 935494845 - Control 1682833869 - Property 1295455071
source: Specifies the value of the Modify Permission field.
de_de: Gibt den Wert des Feldes Änderungserlaubnis an.
es_es: Especifica el valor del campo Permiso de modificación.

# Page 935494845 - Control 1247803954 - Property 1295455071
source: Specifies the value of the Object Number field.
de_de: Gibt den Wert des Feldes Objektnummer an.
es_es: Especifica el valor del campo Número de objeto.

# Page 935494845 - Control 1085746399 - Property 1295455071
source: Specifies the value of the Object Type field.
de_de: Gibt den Wert des Feldes Objekttyp an.
es_es: Especifica el valor del campo Tipo de objeto.

# Page 935494845 - Control 3135917451 - Property 1295455071
source: Specifies the value of the Read Permission field.
de_de: Gibt den Wert des Feldes Leseberechtigung an.
es_es: Especifica el valor del campo Permiso de lectura.

# Page 1569293126 - Property 2879900210
source: Objects in License
de_de: Objekte in der Lizenz
es_es: Objetos en la licencia

# Page 1569293126 - Control 3711240756 - Property 1295455071
source: Specifies the value of the Object ID field.
de_de: Gibt die Objekt ID an.
es_es: Especifica el valor del campo ID de objeto.

# Page 1569293126 - Control 1418569422 - Property 1295455071
source: Specifies the value of the Object Name field.
de_de: Gibt den Objektnamen an.
es_es: Especifica el valor del campo Nombre del objeto.

# Page 1569293126 - Control 1085746399 - Property 1295455071
source: Specifies the value of the Object Type field.
de_de: Gibt den Wert des Feldes Objekttyp an.
es_es: Especifica el valor del campo Tipo de objeto.

# Page 1569293126 - Control 3220827225 - Property 1295455071
source: Specifies the value of the Used field.
de_de: Gibt den Wert des Feldes Verwendet an.
es_es: Especifica el valor del campo Usado.

# Page 1569293126 - View 1106942382 - Property 2879900210
source: Free Objects
de_de: Freie Objekte
es_es: Objetos libres

# Page 1569293126 - View 1741861363 - Property 2879900210
source: Used Objects
de_de: Verwendete Objekte
es_es: Objetos usados

# Page 3025933651 - Property 2879900210
source: Tables
de_de: Tabellen
es_es: Tablas

# Page 3025933651 - Control 2558632233 - Property 1295455071
source: Specifies that this table was marked for deletion.
de_de: Gibt an, dass diese Tabelle zur Löschung markiert wurde.
es_es: Especifica que esta tabla fue marcada para ser borrada.

# Page 3025933651 - Control 2065755396 - Property 1295455071
source: Specifies the total no. of records in the table.
de_de: Gibt die Gesamtzahl der Datensätze in der Tabelle an.
es_es: Especifica el número total de registros en la tabla.

# Page 3025933651 - Control 859139943 - Property 1295455071
source: Specifies the no. of table relation errors that were detected when running the table relation check.
de_de: Gibt die Anzahl der Tabellenrelationsfehler an, die bei der Prüfung der Tabellenrelationen festgestellt wurden.
es_es: Especifica el número de errores de relación de tabla que se detectaron al ejecutar la comprobación de relación de tabla.

# Page 3025933651 - Control 3135334477 - Property 1295455071
source: Specifies the ID of the table.
de_de: Gibt die ID der Tabelle an.
es_es: Especifica el ID de la tabla.

# Page 3025933651 - Control 3808951907 - Property 1295455071
source: Specifies the name of the table.
de_de: Gibt den Namen der Tabelle an.
es_es: Especifica el nombre de la tabla.

# Page 3025933651 - Control 1595823452 - Property 1295455071
source: Specifies the caption of the table.
de_de: Gibt die Beschriftung der Tabelle an.
es_es: Especifica el título de la tabla.

# Page 3025933651 - Control 1595823452 - Property 2879900210
source: Table Caption
de_de: Tabellenbezeichnung
es_es: Tabla de subtítulos

# Page 3025933651 - Action 3774338566 - Property 1295455071
source: Opens the table editor where you can edit or delete selected records.
de_de: Öffnet den Tabelleneditor, in dem Sie ausgewählte Datensätze bearbeiten oder löschen können.
es_es: Abre el editor de la tabla donde puede editar o eliminar los registros seleccionados.

# Page 3025933651 - Action 3774338566 - Property 2879900210
source: Edit Table
de_de: Tabelle bearbeiten
es_es: Editar Mesa

# Page 3576430184 - Property 2879900210
source: Record Deletion Rel. Error
de_de: Datensatzlöschung Relationsfehler
es_es: Error en la relación de borrado de registros

# Page 3576430184 - Control 883711285 - Property 1295455071
source: Specifies the Entry No.
de_de: Gibt die Lfd. Nr. an.
es_es: Especifica el número de entrada.

# Page 3576430184 - Control 2248886284 - Property 1295455071
source: Specifies the error text if an error occured
de_de: Gibt den Fehlertext an, wenn ein Fehler aufgetreten ist
es_es: Especifica el texto de error si se produce un error

# Page 3576430184 - Control 3070320983 - Property 1295455071
source: Specifies the Field Name
de_de: Gibt den Feldnamen an
es_es: Especifica el nombre del campo

# Page 3576430184 - Control 3531868071 - Property 1295455071
source: Specifies the Field No.
de_de: Gibt die Feldnummer an.
es_es: Especifica el número de campo.

# Page 3576430184 - Control 3135334477 - Property 1295455071
source: Specifies the Table ID
de_de: Gibt die ID der Tabelle an
es_es: Especifica el ID de la tabla

# Page 2727896929 - Property 1064389655
source: About Table Editor
de_de: Über Table Editor
es_es: Acerca del editor de tablas

# Page 2727896929 - Property 247559172
source: This table editor can modify or delete selected records.
de_de: Dieser Tabelleneditor kann ausgewählte Datensätze ändern oder löschen.
es_es: Este editor de tablas puede modificar o eliminar los registros seleccionados.

# Page 2727896929 - Property 2879900210
source: Table Editor
de_de: Tabelleneditor
es_es: Editor de tablas

# Page 2727896929 - Property 3863440606
source: Debug
es_es: Depurar

# Page 2727896929 - NamedType 809267791
source: Proceed?
de_de: Fortfahren?
es_es: ¿Proceder?

# Page 2727896929 - NamedType 3555668833
source: Do you want to create a new record in table %1?
de_de: Möchten Sie einen neuen Datensatz in Tabelle %1 erstellen?
es_es: ¿Desea crear un nuevo registro en la tabla %1?

# Page 2727896929 - NamedType 669701587
source: Do you want to delete %1 records from table %2?
de_de: Möchten Sie %1 Datensätze aus Tabelle %2 löschen?
es_es: ¿Desea eliminar %1 registros de la tabla %2?
