Repository: wbrakowski/Admin-Toolbox-OnPrem
Catalog: Translations/Admin-Toolbox.*.xlf
Languages: de_de, es_es

# Page 2727896929 - NamedType 2800295767
source: Records will be deleted using DeleteAll(%1).\\Proceed?
de_de: Die Datensätze werden mit DeleteAll(%1).\\ gelöscht. Fortfahren?
es_es: Los registros se eliminarán mediante DeleteAll(%1).\N¿Proceed?

# Page 2727896929 - NamedType 4288424883
source: Done.
de_de: Fertig.
es_es: Hecho.

# Page 2727896929 - NamedType 363604244
source: Filter each primary key field with a constant value. Only then a new record can be created using those values.
de_de: Filtern Sie jedes Primärschlüsselfeld mit einem konstanten Wert. Erst dann kann ein neuer Datensatz mit diesen Werten erstellt werden.
es_es: Filtrar cada campo de clave primaria con un valor constante. Sólo entonces se puede crear un nuevo registro utilizando esos valores.

# Page 2727896929 - NamedType 1516192187
source: Longest value has %1 characters.\%2
de_de: Der längste Wert hat %1 Zeichen.\%2
es_es: El valor más largo tiene %1 ccaracteres.\N

# Page 2727896929 - NamedType 2128188428
source: Do you want to modify %1 records in table %2?
de_de: Möchten Sie %1 Datensätze in Tabelle %2 ändern?
es_es: ¿Desea modificar %1 registros de la tabla %2?

# Page 2727896929 - NamedType 777624542
source: "%1" := [%2];\Modify(%3);\\Proceed?
de_de: "%1" := [%2];\Modify(%3);\\Fortfahren?
es_es: "%1" := [%2];\NModify(%3);\NProceed?

# Page 2727896929 - NamedType 2470041236
source: No records found.
de_de: Keine Datensätze gefunden.
es_es: No se encontraron registros.

# Page 2727896929 - NamedType 1798303574
source: Rename(%1);\\Proceed?
de_de: Rename(%1);\\Fortfahren?
es_es: Renombrar(%1);\N¿Proceder?

# Page 2727896929 - NamedType 4057747532
source: Do you want to rename %1 records in table %2?
de_de: Möchten Sie %1 Datensätze in Tabelle %2 umbenennen?
es_es: ¿Desea renombrar %1 registros en la tabla %2?

# Page 2727896929 - Method 3541026971 - NamedType 577911013
source: Processing tables... @1@@@@@@
de_de: Verarbeite Tabellen... @1@@@@@@
es_es: Procesando tablas... @1@@@@@@

# Page 2727896929 - Method 3541026971 - NamedType 1709914334
source: %1 tables have succesfully been updated.
de_de: %1 Tabellen wurden erfolgreich aktualisiert.
es_es: %1 tablas han sido actualizadas con éxito.

# Page 2727896929 - Control 2071486177 - Property 2879900210
source: Field
de_de: Feld
es_es: Campo

# Page 2727896929 - Control 1329745570 - Property 1295455071
source: Specifies caption of the selected field.
de_de: Gibt die Beschriftung des ausgewählten Feldes an.
es_es: Especifica el título del campo seleccionado.

# Page 2727896929 - Control 1329745570 - Property 2879900210
source: Caption
es_es: Subtítulo

# Page 2727896929 - Control 1913390121 - Property 1295455071
source: Specifies name of the selected field.
de_de: Gibt den Namen des ausgewählten Feldes an.
es_es: Especifica el nombre del campo seleccionado.

# Page 2727896929 - Control 1913390121 - Property 2879900210
source: Name
es_es: Nombre

# Page 2727896929 - Control 3124662229 - Property 1064389655
source: Field selector
de_de: Feldselektor
es_es: Selector de campo

# Page 2727896929 - Control 3124662229 - Property 1295455071
source: Specifies field no. that you want to modify.
de_de: Gibt die Feldnummer an, die Sie ändern möchten.
es_es: Especifica el número de campo que quieres modificar.

# Page 2727896929 - Control 3124662229 - Property 247559172
source: Select the field if you want to modify a field for the selected records
de_de: Wählen Sie das Feld aus, wenn Sie ein Feld für die ausgewählten Datensätze ändern möchten
es_es: Seleccione el campo si desea modificar un campo de los registros seleccionados

# Page 2727896929 - Control 2576247521 - Property 1295455071
source: Specifies the value of the Type field.
de_de: Gibt den Wert des Feldes Typ an.
es_es: Especifica el valor del campo Tipo.

# Page 2727896929 - Control 2576247521 - Property 2879900210
source: Type
de_de: Art
es_es: Tipo

# Page 2727896929 - Control 645473173 - Property 1064389655
source: Choose the new value
de_de: Wählen Sie den neuen Wert
es_es: Elija el nuevo valor

# Page 2727896929 - Control 645473173 - Property 1295455071
source: Specifies the value that the field should have after modifying it.
de_de: Gibt den Wert an, den das Feld nach der Änderung haben soll.
es_es: Especifica el valor que debe tener el campo después de modificarlo.

# Page 2727896929 - Control 645473173 - Property 247559172
source: This is the value that the field will have for the selected records after modifying them.
de_de: Dies ist der Wert, den das Feld für die ausgewählten Datensätze nach der Änderung haben wird.
es_es: Es el valor que tendrá el campo para los registros seleccionados después de modificarlos.

# Page 2727896929 - Control 645473173 - Property 2879900210
source: Value
de_de: Wert
es_es: Valor

# Page 2727896929 - Control 2933813817 - Property 1064389655
source: Enable OnValidateTrigger
de_de: OnValidateTrigger einschalten
es_es: Activar OnValidateTrigger

# Page 2727896929 - Control 2933813817 - Property 1295455071
source: Specifies if you want to use the OnValidate trigger of the field.
de_de: Gibt an, ob Sie den OnValidate-Auslöser des Feldes verwenden möchten.
es_es: Especifica si desea utilizar el activador OnValidate del campo.

# Page 2727896929 - Control 2933813817 - Property 247559172
source: Enable this field if you want to use the OnValidate Trigger of the field when modifying the records.
de_de: Aktivieren Sie dieses Feld, wenn Sie beim Ändern der Datensätze den OnValidate-Trigger des Feldes verwenden möchten.
es_es: Habilite este campo si desea utilizar el activador OnValidate del campo al modificar los registros.

# Page 2727896929 - Control 2933813817 - Property 2879900210
source: Validate
de_de: Validieren
es_es: Validar

# Page 2727896929 - Control 4175714125 - Property 2879900210
source: Table
de_de: Tabelle
es_es: Tabla

# Page 2727896929 - Control 3253608131 - Property 1064389655
source: No. of your selected records
de_de: Anzahl der von Ihnen ausgewählten Datensätze
es_es: Número de sus registros seleccionados

# Page 2727896929 - Control 3253608131 - Property 1295455071
source: Specifies the no. of records that you selected
de_de: Gibt die Anzahl der Datensätze an, die Sie ausgewählt haben
es_es: Especifica el número de registros que ha seleccionado

# Page 2727896929 - Control 3253608131 - Property 247559172
source: Shows how many records you selected in the previous field.
de_de: Zeigt an, wie viele Datensätze Sie im vorherigen Feld ausgewählt haben.
es_es: Muestra el número de registros seleccionados en el campo anterior.

# Page 2727896929 - Control 3253608131 - Property 2879900210
source: Records in Filter
de_de: Datensätze im Filter
es_es: Registros en el filtro

# Page 2727896929 - Control 1018074862 - Property 1064389655
source: Record Selection
de_de: Datensatz-Auswahl
es_es: Selección de discos

# Page 2727896929 - Control 1018074862 - Property 1295455071
source: Specifies the selected records.
de_de: Gibt die ausgewählten Datensätze an.
es_es: Especifica los registros seleccionados.

# Page 2727896929 - Control 1018074862 - Property 247559172
source: Select all the records that you want to modify or delete
de_de: Wählen Sie alle Datensätze aus, die Sie ändern oder löschen möchten
es_es: Seleccione todos los registros que desee modificar o eliminar

# Page 2727896929 - Control 1018074862 - Property 2879900210
source: View
es_es: Ver

# Page 2727896929 - Control 1545557470 - Property 1295455071
source: Specifies the caption of the table where you want to modify or delete records.
de_de: Gibt die Beschriftung der Tabelle an, in der Sie Datensätze ändern oder löschen möchten.
es_es: Especifica el título de la tabla en la que desea modificar o eliminar registros.

# Page 2727896929 - Control 1545557470 - Property 2879900210
source: Caption
es_es: Subtítulo

# Page 2727896929 - Control 3745738151 - Property 1295455071
source: Specifies the ID of the table where you want to modify or delete records.
de_de: Gibt die ID der Tabelle an, in der Sie Datensätze ändern oder löschen möchten.
es_es: Especifica el ID de la tabla en la que se desea modificar o eliminar registros.

# Page 2727896929 - Control 2745026057 - Property 1064389655
source: Do you want to use table triggers?
de_de: Möchten Sie Tabellen-Trigger verwenden?
es_es: ¿Desea utilizar disparadores de tabla?

# Page 2727896929 - Control 2745026057 - Property 1295455071
source: Specifies if you want to run the trigger of the table that you want to modify or delete.
de_de: Gibt an, ob Sie den Trigger der Tabelle, die Sie ändern oder löschen wollen, ausführen wollen.
es_es: Especifica si quieres ejecutar el trigger de la tabla que quieres modificar o eliminar.

# Page 2727896929 - Control 2745026057 - Property 247559172
source: Enable this field if you want to use the table triggers when modifying or deleting records.
de_de: Aktivieren Sie dieses Feld, wenn Sie die Tabellen-Trigger beim Ändern oder Löschen von Datensätzen verwenden möchten.
es_es: Habilite este campo si desea utilizar los activadores de la tabla al modificar o eliminar registros.

# Page 2727896929 - Control 2745026057 - Property 2879900210
source: Use Trigger
de_de: Trigger verwenden
es_es: Utilizar el disparador

# Page 2727896929 - Action 3343869457 - Property 1295455071
source: Executes the Create Record action.
de_de: Führt die Aktion Datensatz erstellen aus.
es_es: Ejecuta la acción de crear un registro.

# Page 2727896929 - Action 3343869457 - Property 2879900210
source: Create Record
de_de: Datensatz erstellen
es_es: Crear Nuevo Registro

# Page 2727896929 - Action 932266291 - Property 1064389655
source: Delete Records
de_de: Datensätze löschen
es_es: Borrar registros

# Page 2727896929 - Action 932266291 - Property 1295455071
source: Deletes the selected records.
de_de: Löscht die ausgewählten Datensätze.
es_es: Elimina los registros seleccionados.

# Page 2727896929 - Action 932266291 - Property 247559172
source: This will delete all the records that you selected in the field "View"
de_de: Dadurch werden alle Datensätze gelöscht, die Sie im Feld "View" ausgewählt haben
es_es: Esto borrará todos los registros que haya seleccionado en el campo "Ver"

# Page 2727896929 - Action 932266291 - Property 2879900210
source: Delete Table Records
de_de: Datensätze löschen
es_es: Borrar registros de la tabla

# Page 2727896929 - Action 275727716 - Property 1295455071
source: Finds the longest value of a field in the table.
de_de: Findet den längsten Wert eines Feldes in der Tabelle.
es_es: Encuentra el valor más largo de un campo en la tabla.

# Page 2727896929 - Action 275727716 - Property 2879900210
source: Find Longest Value
de_de: Längsten Wert finden
es_es: Encontrar el valor más largo

# Page 2727896929 - Action 3302205236 - Property 1064389655
source: Modify Records
de_de: Datensätze ändern
es_es: Modificar registros

# Page 2727896929 - Action 3302205236 - Property 1295455071
source: Modifies the selected records.
de_de: Ändert die ausgewählten Datensätze.
es_es: Modifica los registros seleccionados.

# Page 2727896929 - Action 3302205236 - Property 247559172
source: This will modify all the records that you selected in the field "View"
de_de: Dadurch werden alle Datensätze geändert, die Sie im Feld "Ansicht" ausgewählt haben
es_es: Esto modificará todos los registros que haya seleccionado en el campo "Ver"

# Page 2727896929 - Action 3302205236 - Property 2879900210
source: Modify Table Records
de_de: Datensätze modifizieren
es_es: Modificar los registros de la tabla

# Page 670616998 - Property 2879900210
source: Unlicensed Objects
de_de: Nicht lizenzierte Objekte
es_es: Objetos sin licencia

# Page 670616998 - Control 3711240756 - Property 1295455071
source: Specifies the value of the Object ID field.
de_de: Gibt die Objekt ID an.
es_es: Especifica el valor del campo ID de objeto.

# Page 670616998 - Control 1418569422 - Property 1295455071
source: Specifies the value of the Object Name field.
de_de: Gibt den Objektnamen an.
es_es: Especifica el valor del campo Nombre del objeto.

# Page 670616998 - Control 1085746399 - Property 1295455071
source: Specifies the value of the Object Type field.
de_de: Gibt den Wert des Feldes Objekttyp an.
es_es: Especifica el valor del campo Tipo de objeto.

# Report 1924762098 - Property 2879900210
source: Export Used and Not Used Objects
de_de: Verwendete und nicht verwendete Objekte exportieren
es_es: Exportar objetos utilizados y no utilizados

# Report 1924762098 - Control 3904799447 - Property 1295455071
source: Specifies the value of the Object Types Filter field.
de_de: Gibt den Wert des Feldes Objekttypenfilter an.
es_es: Especifica el valor del campo Filtro de Tipos de Objeto.

# Report 1924762098 - Control 3904799447 - Property 2879900210
source: Object Types Filter
de_de: Objekttypen-Filter
es_es: Filtro de tipos de objetos

# Report 1924762098 - Control 3904799447 - Property 62802879
source: ,Table,,Report,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
de_de: ,Tabelle,,Bericht,,Codeunit,XMLport,MenuSuite,Seite,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
es_es: ,Tabla,,Informe,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension

# Report 1924762098 - Control 2432487110 - Property 1295455071
source: Specifies the value of the Objects ID (Number) Filter field.
de_de: Gibt den Wert des Feldes Objekt-ID (Nummer) Filter an.
es_es: Especifica el valor del campo Filtro de ID de objetos (número).

# Report 1924762098 - Control 2432487110 - Property 2879900210
source: Objects ID (Number) Filter
de_de: Objekte ID (Nummer) Filter
es_es: Objetos ID (Número) Filtro

# Report 1924762098 - Control 1331043751 - Property 1295455071
source: Specifies the value of the Only Free Objects field.
de_de: Gibt den Wert des Feldes Nur freie Objekte an.
es_es: Especifica el valor del campo Sólo objetos libres.

# Report 1924762098 - Control 1331043751 - Property 2879900210
source: Only Free Objects
de_de: Nur freie Objekte
es_es: Sólo objetos libres

# Report 1924762098 - Control 1491504858 - Property 1295455071
source: Specifies the value of the Only Used Objects field.
de_de: Gibt den Wert des Feldes "Nur verwendete Objekte" an.
es_es: Especifica el valor del campo Sólo objetos utilizados.

# Report 1924762098 - Control 1491504858 - Property 2879900210
source: Only Used Objects
de_de: Nur verwendete Objekte
es_es: Sólo objetos usados

# Report 1169104498 - Property 2879900210
source: Export Unlicensed Objects
de_de: Nicht lizenzierte Objekte exportieren
es_es: Exportar objetos sin licencia

# Report 1169104498 - Control 3904799447 - Property 1295455071
source: Specifies the value of the Object Types Filter field.
de_de: Gibt den Wert des Feldes Objekttypenfilter an.
es_es: Especifica el valor del campo Filtro de Tipos de Objeto.

# Report 1169104498 - Control 3904799447 - Property 2879900210
source: Object Types Filter
de_de: Objekttypen-Filter
es_es: Filtro de tipos de objetos

# Report 1169104498 - Control 3904799447 - Property 62802879
source: ,Table,,Report,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
de_de: ,Tabelle,,Bericht,,Codeunit,XMLport,MenuSuite,Seite,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension
es_es: ,Tabla,,Informe,,Codeunit,XMLport,MenuSuite,Page,Query,,,,,PageExtension,TableExtension,Enum,EnumExtension,,,PermissionSet,PermissionSetExtension,ReportExtension

# Report 1169104498 - Control 2432487110 - Property 1295455071
source: Specifies the value of the Objects ID (Number) Filter field.
de_de: Gibt den Wert des Feldes Objekt-ID (Nummer) Filter an.
es_es: Especifica el valor del campo Filtro de ID de objetos (número).

# Report 1169104498 - Control 2432487110 - Property 2879900210
source: Objects ID (Number) Filter
de_de: Objekte ID (Nummer) Filter
es_es: Objetos ID (Número) Filtro

# Table 3576430184 - Field 2248886284 - Property 2879900210
source: Error
de_de: Fehler

# Page 3768843830 - Control 4138364935 - Property 2879900210
source: Metadata
de_de: Metadaten

# Page 2727896929 - NamedType 3818357216
source: Validate("%1", [%2]);\Modify(%3);\\Proceed?
de_de: Validate("%1", [%2]);\Modify(%3);\\Fortfahren?

# Page 2727896929 - Control 3124662229 - Property 2879900210
source: No.
de_de: Nr.
